###############################################################
#  Generated by:      Cadence Innovus 20.14-s095_1
#  OS:                Linux x86_64(Host ID pesc-25.pes.edu)
#  Generated on:      Wed Jul 23 15:18:30 2025
#  Design:            Top
###############################################################
current_design Top
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk_pad}]  -name clk -period 100.000000 -waveform {0.000000 50.000000}
set_clock_latency -source -early -min  0.15 [get_clocks {clk}]
set_clock_latency -source -early -max  0.2 [get_clocks {clk}]
set_clock_latency -source -late -min  0.15 [get_clocks {clk}]
set_clock_latency -source -late -max  0.2 [get_clocks {clk}]
set_clock_transition  -rise -min 12.5 [get_clocks {clk}]
set_clock_transition  -rise -max 20 [get_clocks {clk}]
set_clock_transition  -fall -min 12.5 [get_clocks {clk}]
set_clock_transition  -fall -max 20 [get_clocks {clk}]
set_propagated_clock  [get_ports {clk_pad}]
set_input_transition -min 0.1  [get_ports {reset_pad}]
set_input_transition -max 0.2  [get_ports {reset_pad}]
set_input_transition -min 0.1  [get_ports {key_pad[7]}]
set_input_transition -max 0.2  [get_ports {key_pad[7]}]
set_input_transition -min 0.1  [get_ports {key_pad[6]}]
set_input_transition -max 0.2  [get_ports {key_pad[6]}]
set_input_transition -min 0.1  [get_ports {key_pad[5]}]
set_input_transition -max 0.2  [get_ports {key_pad[5]}]
set_input_transition -min 0.1  [get_ports {key_pad[4]}]
set_input_transition -max 0.2  [get_ports {key_pad[4]}]
set_input_transition -min 0.1  [get_ports {key_pad[3]}]
set_input_transition -max 0.2  [get_ports {key_pad[3]}]
set_input_transition -min 0.1  [get_ports {key_pad[2]}]
set_input_transition -max 0.2  [get_ports {key_pad[2]}]
set_input_transition -min 0.1  [get_ports {key_pad[1]}]
set_input_transition -max 0.2  [get_ports {key_pad[1]}]
set_input_transition -min 0.1  [get_ports {key_pad[0]}]
set_input_transition -max 0.2  [get_ports {key_pad[0]}]
set_input_transition -min 0.1  [get_ports {Plaintxt_pad[3]}]
set_input_transition -max 0.2  [get_ports {Plaintxt_pad[3]}]
set_input_transition -min 0.1  [get_ports {Plaintxt_pad[2]}]
set_input_transition -max 0.2  [get_ports {Plaintxt_pad[2]}]
set_input_transition -min 0.1  [get_ports {Plaintxt_pad[1]}]
set_input_transition -max 0.2  [get_ports {Plaintxt_pad[1]}]
set_input_transition -min 0.1  [get_ports {Plaintxt_pad[0]}]
set_input_transition -max 0.2  [get_ports {Plaintxt_pad[0]}]
set_input_transition -min 0.1  [get_ports {start_pad}]
set_input_transition -max 0.2  [get_ports {start_pad}]
set_load -pin_load -max  5  [get_ports {cipher_pad[3]}]
set_load -pin_load -min  5  [get_ports {cipher_pad[3]}]
set_load -pin_load -max  5  [get_ports {cipher_pad[2]}]
set_load -pin_load -min  5  [get_ports {cipher_pad[2]}]
set_load -pin_load -max  5  [get_ports {cipher_pad[1]}]
set_load -pin_load -min  5  [get_ports {cipher_pad[1]}]
set_load -pin_load -max  5  [get_ports {cipher_pad[0]}]
set_load -pin_load -min  5  [get_ports {cipher_pad[0]}]
set_load -pin_load -max  5  [get_ports {done_final_pad}]
set_load -pin_load -min  5  [get_ports {done_final_pad}]
set_load -pin_load -max  5  [get_ports {out_txt_pad[3]}]
set_load -pin_load -min  5  [get_ports {out_txt_pad[3]}]
set_load -pin_load -max  5  [get_ports {out_txt_pad[2]}]
set_load -pin_load -min  5  [get_ports {out_txt_pad[2]}]
set_load -pin_load -max  5  [get_ports {out_txt_pad[1]}]
set_load -pin_load -min  5  [get_ports {out_txt_pad[1]}]
set_load -pin_load -max  5  [get_ports {out_txt_pad[0]}]
set_load -pin_load -min  5  [get_ports {out_txt_pad[0]}]
set_load -pin_load -max  5  [get_ports {test_pad[5]}]
set_load -pin_load -min  5  [get_ports {test_pad[5]}]
set_load -pin_load -max  5  [get_ports {test_pad[4]}]
set_load -pin_load -min  5  [get_ports {test_pad[4]}]
set_load -pin_load -max  5  [get_ports {test_pad[3]}]
set_load -pin_load -min  5  [get_ports {test_pad[3]}]
set_load -pin_load -max  5  [get_ports {test_pad[2]}]
set_load -pin_load -min  5  [get_ports {test_pad[2]}]
set_load -pin_load -max  5  [get_ports {test_pad[1]}]
set_load -pin_load -min  5  [get_ports {test_pad[1]}]
set_load -pin_load -max  5  [get_ports {test_pad[0]}]
set_load -pin_load -min  5  [get_ports {test_pad[0]}]
set_load -pin_load -max  5  [get_ports {txt_done_final_pad}]
set_load -pin_load -min  5  [get_ports {txt_done_final_pad}]
set_wire_load_mode enclosed
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {reset_pad}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {reset_pad}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[6]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[6]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[3]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[4]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[4]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[1]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[1]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[2]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[0]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[7]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[7]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[5]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[5]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[2]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[2]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {start_pad}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {start_pad}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[3]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[3]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[0]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {Plaintxt_pad[0]}]
set_input_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {key_pad[1]}]
set_input_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {key_pad[1]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[4]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[4]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[2]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {out_txt_pad[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {out_txt_pad[2]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[0]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {out_txt_pad[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {out_txt_pad[0]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {cipher_pad[2]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {cipher_pad[2]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {cipher_pad[0]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {cipher_pad[0]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {done_final_pad}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {done_final_pad}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[5]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[5]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {txt_done_final_pad}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {txt_done_final_pad}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[3]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {out_txt_pad[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {out_txt_pad[3]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {test_pad[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {test_pad[1]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {out_txt_pad[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {out_txt_pad[1]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {cipher_pad[3]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {cipher_pad[3]}]
set_output_delay -add_delay 0.3 -min -clock [get_clocks {clk}] [get_ports {cipher_pad[1]}]
set_output_delay -add_delay 0.4 -max -clock [get_clocks {clk}] [get_ports {cipher_pad[1]}]
set_clock_uncertainty 0.01 [get_clocks {clk}]
set __coll_2 [get_pins {{u_simon/u_encrypt/i_cur_reg[1]/D} {u_simon/u_encrypt/i_cur_reg[2]/D} {u_simon/u_encrypt/i_cur_reg[3]/D} {u_simon/u_encrypt/i_cur_reg[4]/D} {u_simon/u_encrypt/y_cur_reg[0]/D} {u_simon/u_encrypt/y_cur_reg[1]/D} {u_simon/u_encrypt/y_cur_reg[2]/D} {u_simon/u_encrypt/y_cur_reg[3]/D} {u_simon/u_encrypt/y_cur_reg[4]/D} {u_simon/u_encrypt/y_cur_reg[5]/D} {u_simon/u_encrypt/y_cur_reg[6]/D} {u_simon/u_encrypt/y_cur_reg[7]/D} {u_simon/u_encrypt/y_cur_reg[8]/D} {u_simon/u_encrypt/y_cur_reg[9]/D} {u_simon/u_encrypt/y_cur_reg[10]/D} {u_simon/u_encrypt/y_cur_reg[11]/D} {u_simon/u_encrypt/y_cur_reg[12]/D} {u_simon/u_encrypt/y_cur_reg[13]/D} {u_simon/u_encrypt/y_cur_reg[14]/D} {u_simon/u_encrypt/y_cur_reg[15]/D} {u_simon/u_key_gen/key0_reg[1]/D} {u_simon/u_key_gen/key0_reg[2]/D} {u_simon/u_key_gen/key0_reg[3]/D} {u_simon/u_key_gen/key0_reg[4]/D} {u_simon/u_key_gen/key2_reg[0]/D} {u_simon/u_key_gen/key2_reg[2]/D} {u_simon/u_key_gen/key2_reg[3]/D} {u_simon/u_key_gen/key2_reg[4]/D} {u_simon/u_key_gen/key2_reg[5]/D} {u_simon/u_key_gen/key2_reg[6]/D} {u_simon/u_key_gen/key2_reg[7]/D} {u_simon/u_key_gen/key2_reg[8]/D} {u_simon/u_key_gen/key2_reg[9]/D} {u_simon/u_key_gen/key2_reg[10]/D} {u_simon/u_key_gen/key2_reg[11]/D} {u_simon/u_key_gen/key2_reg[12]/D} {u_simon/u_key_gen/key2_reg[13]/D} {u_simon/u_key_gen/key2_reg[14]/D} {u_simon/u_key_gen/key2_reg[15]/D} {u_simon/u_key_gen/key3_reg[0]/D} {u_simon/u_key_gen/key3_reg[5]/D} {u_simon/u_key_gen/key3_reg[6]/D} {u_simon/u_key_gen/key3_reg[7]/D} {u_simon/u_key_gen/key3_reg[8]/D} {u_simon/u_key_gen/key3_reg[9]/D} {u_simon/u_key_gen/key3_reg[10]/D} {u_simon/u_key_gen/key3_reg[11]/D} {u_simon/u_key_gen/key3_reg[12]/D} {u_simon/u_key_gen/key3_reg[13]/D} {u_simon/u_key_gen/key3_reg[14]/D} {u_simon/u_key_gen/key3_reg[15]/D} {u_simon/u_key_gen/i_cur_reg[0]/D} {u_simon/u_key_gen/i_cur_reg[1]/D} {u_simon/u_key_gen/i_cur_reg[2]/D} {u_simon/u_key_gen/i_cur_reg[3]/D} {u_simon/u_key_gen/i_cur_reg[4]/D} {u_simon/u_key_gen/i_cur_reg[5]/D} {u_simon/u_key_gen/key1_reg[0]/D} {u_simon/u_key_gen/key1_reg[3]/D} {u_simon/u_key_gen/key1_reg[4]/D} {u_simon/u_key_gen/key1_reg[5]/D} {u_simon/u_key_gen/key1_reg[6]/D} {u_simon/u_key_gen/key1_reg[7]/D} {u_simon/u_key_gen/key1_reg[8]/D} {u_simon/u_key_gen/key1_reg[9]/D} {u_simon/u_key_gen/key1_reg[10]/D} {u_simon/u_key_gen/key1_reg[11]/D} {u_simon/u_key_gen/key1_reg[12]/D} {u_simon/u_key_gen/key1_reg[13]/D} {u_simon/u_key_gen/key1_reg[14]/D} {u_simon/u_key_gen/key1_reg[15]/D} {u_simon/u_key_gen/key3_reg[1]/D} {u_simon/u_key_gen/key3_reg[2]/D} {u_simon/u_key_gen/key3_reg[3]/D} {u_simon/u_key_gen/key3_reg[4]/D} {u_simon/u_key_gen/key1_reg[1]/D} {u_simon/u_key_gen/key2_reg[1]/D} {u_simon/u_key_gen/key0_reg[14]/D} {u_simon/u_key_gen/key0_reg[15]/D} {u_simon/u_key_gen/key0_reg[0]/D} {u_simon/u_key_gen/key0_reg[5]/D} {u_simon/u_key_gen/key0_reg[6]/D} {u_simon/u_key_gen/key0_reg[13]/D} {u_simon/u_key_gen/key0_reg[8]/D} {u_simon/u_key_gen/key0_reg[9]/D} {u_simon/u_key_gen/key0_reg[10]/D} {u_simon/u_key_gen/key0_reg[11]/D} {u_simon/u_key_gen/key0_reg[12]/D} {u_simon/u_key_gen/key0_reg[7]/D} {u_input_taker/data_reg[0]/D} {u_input_taker/data_reg[1]/D} {u_input_taker/data_reg[2]/D} {u_input_taker/data_reg[3]/D} {u_input_taker/data_reg[4]/D} {u_input_taker/data_reg[5]/D} {u_input_taker/data_reg[6]/D} {u_input_taker/data_reg[7]/D} {u_input_taker/data_reg[8]/D} {u_input_taker/data_reg[9]/D} {u_input_taker/data_reg[10]/D} {u_input_taker/data_reg[11]/D} {u_input_taker/data_reg[12]/D} {u_input_taker/data_reg[13]/D} {u_input_taker/data_reg[14]/D} {u_input_taker/data_reg[15]/D} {u_input_taker/data_reg[16]/D} {u_input_taker/data_reg[17]/D} {u_input_taker/data_reg[18]/D} {u_input_taker/data_reg[19]/D} {u_input_taker/data_reg[20]/D} {u_input_taker/data_reg[21]/D} {u_input_taker/data_reg[22]/D} {u_input_taker/data_reg[23]/D} {u_input_taker/data_reg[24]/D} {u_input_taker/data_reg[25]/D} {u_input_taker/data_reg[26]/D} {u_input_taker/data_reg[27]/D} {u_input_taker/data_reg[28]/D} {u_input_taker/data_reg[29]/D} {u_input_taker/data_reg[30]/D} {u_input_taker/data_reg[31]/D} {u_input_taker/key_out_reg[0]/D} {u_input_taker/key_out_reg[1]/D} {u_input_taker/key_out_reg[2]/D} {u_input_taker/key_out_reg[3]/D} {u_input_taker/key_out_reg[4]/D} {u_input_taker/key_out_reg[5]/D} {u_input_taker/key_out_reg[6]/D} {u_input_taker/key_out_reg[7]/D} {u_input_taker/key_out_reg[8]/D} {u_input_taker/key_out_reg[9]/D} {u_input_taker/key_out_reg[10]/D} {u_input_taker/key_out_reg[11]/D} {u_input_taker/key_out_reg[12]/D} {u_input_taker/key_out_reg[13]/D} {u_input_taker/key_out_reg[14]/D} {u_input_taker/key_out_reg[15]/D} {u_input_taker/key_out_reg[16]/D} {u_input_taker/key_out_reg[17]/D} {u_input_taker/key_out_reg[18]/D} {u_input_taker/key_out_reg[19]/D} {u_input_taker/key_out_reg[20]/D} {u_input_taker/key_out_reg[21]/D} {u_input_taker/key_out_reg[22]/D} {u_input_taker/key_out_reg[23]/D} {u_input_taker/key_out_reg[24]/D} {u_input_taker/key_out_reg[25]/D} {u_input_taker/key_out_reg[26]/D} {u_input_taker/key_out_reg[27]/D} {u_input_taker/key_out_reg[28]/D} {u_input_taker/key_out_reg[29]/D} {u_input_taker/key_out_reg[30]/D} {u_input_taker/key_out_reg[31]/D} {u_input_taker/key_out_reg[32]/D} {u_input_taker/key_out_reg[33]/D} {u_input_taker/key_out_reg[34]/D} {u_input_taker/key_out_reg[35]/D} {u_input_taker/key_out_reg[36]/D} {u_input_taker/key_out_reg[37]/D} {u_input_taker/key_out_reg[38]/D} {u_input_taker/key_out_reg[39]/D} {u_input_taker/key_out_reg[40]/D} {u_input_taker/key_out_reg[41]/D} {u_input_taker/key_out_reg[42]/D} {u_input_taker/key_out_reg[43]/D} {u_input_taker/key_out_reg[44]/D} {u_input_taker/key_out_reg[45]/D} {u_input_taker/key_out_reg[46]/D} {u_input_taker/key_out_reg[47]/D} {u_input_taker/key_out_reg[48]/D} {u_input_taker/key_out_reg[49]/D} {u_input_taker/key_out_reg[50]/D} {u_input_taker/key_out_reg[51]/D} {u_input_taker/key_out_reg[52]/D} {u_input_taker/key_out_reg[53]/D} {u_input_taker/key_out_reg[54]/D} {u_input_taker/key_out_reg[55]/D} {u_input_taker/key_out_reg[56]/D} {u_input_taker/key_out_reg[57]/D} {u_input_taker/key_out_reg[58]/D} {u_input_taker/key_out_reg[59]/D} {u_input_taker/key_out_reg[60]/D} {u_input_taker/key_out_reg[61]/D} {u_input_taker/key_out_reg[62]/D} {u_input_taker/key_out_reg[63]/D} {u_input_taker/state_reg[1]/D} {u_input_taker/state_reg[3]/D} {u_input_checker/buffer_reg_reg[0]/D} {u_input_checker/buffer_reg_reg[1]/D} {u_input_checker/buffer_reg_reg[2]/D} {u_input_checker/buffer_reg_reg[3]/D} {u_input_checker/buffer_reg_reg[4]/D} {u_input_checker/buffer_reg_reg[5]/D} {u_input_checker/buffer_reg_reg[6]/D} {u_input_checker/buffer_reg_reg[7]/D} {u_input_checker/buffer_reg_reg[8]/D} {u_input_checker/buffer_reg_reg[9]/D} {u_input_checker/buffer_reg_reg[10]/D} {u_input_checker/buffer_reg_reg[11]/D} {u_input_checker/buffer_reg_reg[12]/D} {u_input_checker/buffer_reg_reg[13]/D} {u_input_checker/buffer_reg_reg[14]/D} {u_input_checker/buffer_reg_reg[15]/D} {u_input_checker/buffer_reg_reg[16]/D} {u_input_checker/buffer_reg_reg[17]/D} {u_input_checker/buffer_reg_reg[18]/D} {u_input_checker/buffer_reg_reg[19]/D} {u_input_checker/buffer_reg_reg[20]/D} {u_input_checker/buffer_reg_reg[21]/D} {u_input_checker/buffer_reg_reg[22]/D} {u_input_checker/buffer_reg_reg[23]/D} {u_input_checker/buffer_reg_reg[24]/D} {u_input_checker/buffer_reg_reg[25]/D} {u_input_checker/buffer_reg_reg[26]/D} {u_input_checker/buffer_reg_reg[27]/D} {u_input_checker/buffer_reg_reg[28]/D} {u_input_checker/buffer_reg_reg[29]/D} {u_input_checker/buffer_reg_reg[30]/D}}]
append_to_collection __coll_2 [get_pins {{u_input_checker/buffer_reg_reg[31]/D} {u_input_checker/i_cur_reg[3]/D} {u_input_checker/i_cur_reg[4]/D} {u_output_giver/buffer_reg_reg[0]/D} {u_output_giver/buffer_reg_reg[1]/D} {u_output_giver/buffer_reg_reg[2]/D} {u_output_giver/buffer_reg_reg[3]/D} {u_output_giver/buffer_reg_reg[4]/D} {u_output_giver/buffer_reg_reg[5]/D} {u_output_giver/buffer_reg_reg[6]/D} {u_output_giver/buffer_reg_reg[7]/D} {u_output_giver/buffer_reg_reg[8]/D} {u_output_giver/buffer_reg_reg[9]/D} {u_output_giver/buffer_reg_reg[10]/D} {u_output_giver/buffer_reg_reg[11]/D} {u_output_giver/buffer_reg_reg[12]/D} {u_output_giver/buffer_reg_reg[13]/D} {u_output_giver/buffer_reg_reg[14]/D} {u_output_giver/buffer_reg_reg[15]/D} {u_output_giver/buffer_reg_reg[16]/D} {u_output_giver/buffer_reg_reg[17]/D} {u_output_giver/buffer_reg_reg[18]/D} {u_output_giver/buffer_reg_reg[19]/D} {u_output_giver/buffer_reg_reg[20]/D} {u_output_giver/buffer_reg_reg[21]/D} {u_output_giver/buffer_reg_reg[22]/D} {u_output_giver/buffer_reg_reg[23]/D} {u_output_giver/buffer_reg_reg[24]/D} {u_output_giver/buffer_reg_reg[25]/D} {u_output_giver/buffer_reg_reg[26]/D} {u_output_giver/buffer_reg_reg[27]/D} {u_output_giver/buffer_reg_reg[28]/D} {u_output_giver/buffer_reg_reg[29]/D} {u_output_giver/buffer_reg_reg[30]/D} {u_output_giver/buffer_reg_reg[31]/D} {u_output_giver/i_cur_reg[3]/D} {u_output_giver/i_cur_reg[4]/D} u_simon/buffer_reg/D u_simon/start_prev_reg/D {u_output_giver/cipher_reg[0]/D} {u_output_giver/cipher_reg[3]/D} {u_output_giver/cipher_reg[2]/D} {u_output_giver/cipher_reg[1]/D} u_output_giver/done_reg/D {u_input_checker/cipher_reg[0]/D} {u_input_checker/cipher_reg[3]/D} {u_input_checker/cipher_reg[2]/D} {u_input_checker/cipher_reg[1]/D} u_input_checker/done_reg/D u_input_taker/done_reg/D u_input_taker/start_buf_reg/D {u_input_taker/key_buf_reg[0]/D} {u_input_taker/key_buf_reg[5]/D} {u_input_taker/key_buf_reg[6]/D} {u_input_taker/Plaintxt_buf_reg[2]/D} {u_input_taker/Plaintxt_buf_reg[0]/D} {u_input_taker/Plaintxt_buf_reg[3]/D} {u_input_taker/key_buf_reg[7]/D} {u_input_taker/key_buf_reg[1]/D} {u_input_taker/key_buf_reg[2]/D} {u_input_taker/key_buf_reg[3]/D} {u_input_taker/key_buf_reg[4]/D} {u_input_taker/Plaintxt_buf_reg[1]/D} {u_input_taker/state_reg[0]/D} {u_input_taker/state_reg[2]/D} {u_simon/u_encrypt/i_cur_reg[0]/D} {u_simon/u_encrypt/x_cur_reg[0]/D} {u_simon/u_encrypt/x_cur_reg[1]/D} {u_simon/u_encrypt/x_cur_reg[2]/D} {u_simon/u_encrypt/x_cur_reg[3]/D} {u_simon/u_encrypt/x_cur_reg[4]/D} {u_simon/u_encrypt/x_cur_reg[5]/D} {u_simon/u_encrypt/x_cur_reg[6]/D} {u_simon/u_encrypt/x_cur_reg[7]/D} {u_simon/u_encrypt/x_cur_reg[8]/D} {u_simon/u_encrypt/x_cur_reg[9]/D} {u_simon/u_encrypt/x_cur_reg[10]/D} {u_simon/u_encrypt/x_cur_reg[11]/D} {u_simon/u_encrypt/x_cur_reg[12]/D} {u_simon/u_encrypt/x_cur_reg[13]/D} {u_simon/u_encrypt/x_cur_reg[14]/D} {u_simon/u_encrypt/x_cur_reg[15]/D} {u_simon/j_cur_reg[2]/D} {u_simon/j_cur_reg[1]/D} {u_simon/j_cur_reg[0]/D} {u_output_giver/i_cur_reg[2]/D} {u_output_giver/i_cur_reg[5]/D} {u_input_checker/i_cur_reg[2]/D} {u_input_checker/i_cur_reg[5]/D} {u_simon/u_key_gen/key1_reg[2]/D} {u_simon/u_encrypt/i_cur_reg[5]/D}}]
set_false_path  -from [get_ports {reset_pad start_pad}]  -to $__coll_2  
set_clock_latency -source -early -min -rise  -1.0656 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -early -min -fall  -1.60748 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -early -max -rise  -1.0156 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -early -max -fall  -1.55748 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -late -min -rise  -1.0656 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -late -min -fall  -1.60748 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -late -max -rise  -1.0156 [get_ports {clk_pad}] -clock clk 
set_clock_latency -source -late -max -fall  -1.55748 [get_ports {clk_pad}] -clock clk 
